Question_Dict={
'چه تیمی توانسته در تاریخ به 6 گانه برسد ؟':"بارسلونا",
'ادم فضایی لقب کدام بازیکن است ؟':'مسی',
"کدام نوع سلول (جانوری,گیاهی) دارای دیواره ی سلولی است ؟":"گیاهی"
,'چه تیمی بیشترین قهرمانی لیگ قهرمانان اروپا رادارد':"رئال"
,"الکلاسیکو مربوط به لیگ کدام کشور است ؟":"اسپانیا"
,"استقلال چند بار قهرمان آسیا شده؟":"2"
,"فوتبال توسط چه کشوری ساخته شد؟":"المان"
,"گل ایران را به پرتغال چه کسی زد؟":"انصاری"
,"گل آرژانین به ایران در سال۲۰۱۴کی زد ؟" : "مسی"
,"اکنون سوارز درچه تیمی است ؟": "اتلتیکو"
,"بیشترین قهرمانی لیگ خلیج فارس راچه تیمی داشته" : "پرس"
,"خوردن ———- مانع ریزش و سفید شدن موها می شود؟":"کاهو"
,"غذای مغز لقب کدام ماده غذایی است؟":"گردو"
,"کمبود کدام ویتامین سبب رقیق شدن خون انسان و نهایتا خونریزی می شود؟":"k"
,'مایع موجود در کدام میوه را می توان به عنوان پلاسمای خون استفاده کرد؟':"نارگیل"
,"ماده غذایی که هرگز فاسد نمی شود؟":"عسل"
,"کدام اندام داخلی بدن قادر به ترمیم خود است؟":"کبد"
,"مقاوم ترین ماهیچه بدن انسان کدام است؟":"زبان"
,"چند گروه خونی در انسان ها وجود دارد؟":"4"
,"کدام رگ وظیفه انتقال خون از اندام های بدن به قلب را بر عهده دارد؟":'سیاهرگ'
,"هورمون کنترل کننده مصرف قند در بدن چه نام دارد؟":"انسولین"
,"قند شیر را چه می گویند؟":"لاکتوز"
,"منبع اصلی تامین ویتامین دی چیست؟":"نور"
,"اصطلاحی در فوتبال به معنای بازی های درون شهری؟":"دربی"
,"برترین گل زن تاریخ رئال مادرید؟":"رونالدو"
,"میزبان جام جهانی ۲۰۱۴ کدام کشور بود؟":"برزیل"
,"در تاریخ فوتبال باشگاهی چه تیمی دو بار سه جام در یک فصل فتح کرده است؟":"بارسلونا"
,'اهنگ "بهت قول میدم" از کیست ؟':'یگانه'}